package webClass_0830;

public class Main 
{
	public static void main(String[] args)
	{
		System.out.println("라이브러리란 무엇일까?");
		// 도서관, 책들이 있다. => 정보의 모음이다.
		// 2층 인문관, 3층 전문서적
		// 책 => 데이터, 기능
		// 클래스 => 변수(데이터), 메서드(기능))
		// 분류 => 책을 어떻게 분류? 내용, 종류에 따라
		// 분류 => 데이터나 기능에 따라
		
		// 모듈 || 라이브러리
		// 모듈 => 새로운 기계를 꽂아넣는다? => 모듈을 장착한다.
		// 모듈 => (장비 / 기계)(모듈)를 새롭게 추가한다.
		// 프로그래밍에서의 모듈? => 폴더, 패키지, 프로젝트
		
		// 라이브러리 => library
		// src => sourcse
		// library => lib
		// 기계어를 저장하는 binary => bin
		
		// 프레임워크 || 라이브러리 || 모듈
		// 프레임워크 => 기능의 집합체, 가져다 사용한다.
		// 프레임워크 VS 라이브러리
		// 프레임워크 => frame : 틀, 뼈대 / work : 일하다
		// 프레임워크 => 일하는 틀? => 틀을 만든다? => 틀에서 일한다. | 틀에 맞춰서 일한다.
		// 일한다 => 코드작성 => 틀에 맞춘데 => 규칙이 정해져있는 라이브러리다.
		
	}
}
